cylinder_2D_Re100/system/blockMeshDict.m2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

lengthX 2.2;
lengthY 0.41;
lengthZ 0.01;
cylinderX 0.2;
cylinderY 0.2;
radiusIn 0.05;
radiusMid #eval{ 2.55 * $radiusIn };
radiusOut #eval{ 3 * $radiusIn };
sin45RIn #eval{ sqrt(2)/2 * $radiusIn };
sin45ROut #eval{ sqrt(2)/2 * $radiusOut };
// modify these values to refine the mesh
blocksInR 120;
blocksOutR 60;
blocksCirc 100;
blocksWake 400;
blocksInlet 40;
//
gradIn 0.1;
gradWake 4.0;
gradWall 2.5;

scale   1;

vertices
(
    // bottom plane, z=0
    (0 0 0) // 0
    (#eval{ $cylinderX - $sin45ROut } 0 0) // 1
    (#eval{ $cylinderX + $sin45ROut } 0 0) // 2
    ($lengthX 0 0) // 3
    (0 #eval{ $cylinderY - $sin45ROut} 0) // 4
    (#eval{ $cylinderX - $sin45ROut }  #eval{ $cylinderY - $sin45ROut} 0) // 5
    (#eval{ $cylinderX - $sin45RIn }  #eval{ $cylinderY - $sin45RIn} 0) // 6
    (#eval{ $cylinderX + $sin45RIn }  #eval{ $cylinderY - $sin45RIn} 0) // 7
    (#eval{ $cylinderX + $sin45ROut }  #eval{ $cylinderY - $sin45ROut} 0) // 8
    ($lengthX #eval{ $cylinderY - $sin45ROut} 0) // 9
    (0 #eval{ $cylinderY + $sin45ROut} 0) // 10
    (#eval{ $cylinderX - $sin45ROut }  #eval{ $cylinderY + $sin45ROut} 0) // 11
    (#eval{ $cylinderX - $sin45RIn }  #eval{ $cylinderY + $sin45RIn} 0) // 12
    (#eval{ $cylinderX + $sin45RIn }  #eval{ $cylinderY + $sin45RIn} 0) // 13
    (#eval{ $cylinderX + $sin45ROut }  #eval{ $cylinderY + $sin45ROut} 0) // 14
    ($lengthX #eval{ $cylinderY + $sin45ROut} 0) // 15
    (0 $lengthY 0) // 16
    (#eval{ $cylinderX - $sin45ROut } $lengthY 0) // 17
    (#eval{ $cylinderX + $sin45ROut } $lengthY 0) // 18
    ($lengthX $lengthY 0) // 19

    // top plane, z=0.01
    (0 0 $lengthZ) // 20
    (#eval{ $cylinderX - $sin45ROut } 0 $lengthZ) // 21
    (#eval{ $cylinderX + $sin45ROut } 0 $lengthZ) // 22
    ($lengthX 0 $lengthZ) // 23
    (0 #eval{ $cylinderY - $sin45ROut} $lengthZ) // 24
    (#eval{ $cylinderX - $sin45ROut }  #eval{ $cylinderY - $sin45ROut} $lengthZ) // 25
    (#eval{ $cylinderX - $sin45RIn }  #eval{ $cylinderY - $sin45RIn} $lengthZ) // 26
    (#eval{ $cylinderX + $sin45RIn }  #eval{ $cylinderY - $sin45RIn} $lengthZ) // 27
    (#eval{ $cylinderX + $sin45ROut }  #eval{ $cylinderY - $sin45ROut} $lengthZ) // 28
    ($lengthX #eval{ $cylinderY - $sin45ROut} $lengthZ) // 29
    (0 #eval{ $cylinderY + $sin45ROut} $lengthZ) // 30
    (#eval{ $cylinderX - $sin45ROut }  #eval{ $cylinderY + $sin45ROut} $lengthZ) // 31
    (#eval{ $cylinderX - $sin45RIn }  #eval{ $cylinderY + $sin45RIn} $lengthZ) // 32
    (#eval{ $cylinderX + $sin45RIn }  #eval{ $cylinderY + $sin45RIn} $lengthZ) // 33
    (#eval{ $cylinderX + $sin45ROut }  #eval{ $cylinderY + $sin45ROut} $lengthZ) // 34
    ($lengthX #eval{ $cylinderY + $sin45ROut} $lengthZ) // 35
    (0 $lengthY $lengthZ) // 36
    (#eval{ $cylinderX - $sin45ROut } $lengthY $lengthZ) // 37
    (#eval{ $cylinderX + $sin45ROut } $lengthY $lengthZ) // 38
    ($lengthX $lengthY $lengthZ) // 39
);

blocks
(
    hex (0 1 5 4 20 21 25 24) ($blocksInlet $blocksOutR 1) simpleGrading (1 $gradWall 1) // 0
    hex (1 2 8 5 21 22 28 25) ($blocksCirc $blocksOutR 1) simpleGrading (1 $gradWall 1) // 1
    hex (2 3 9 8 22 23 29 28) ($blocksWake $blocksOutR 1) simpleGrading ($gradWake $gradWall 1) // 2
    hex (4 5 11 10 24 25 31 30) ($blocksInlet $blocksCirc 1) simpleGrading (1 1 1) // 3
    hex (5 6 12 11 25 26 32 31) ($blocksInR $blocksCirc 1) simpleGrading ($gradIn 1 1) // 4
    hex (8 7 6 5 28 27 26 25) ($blocksInR $blocksCirc 1) simpleGrading ($gradIn 1 1) // 5
    hex (14 13 7 8 34 33 27 28) ($blocksInR $blocksCirc 1) simpleGrading ($gradIn 1 1) // 6
    hex (11 12 13 14 31 32 33 34) ($blocksInR $blocksCirc 1) simpleGrading ($gradIn 1 1) // 7
    hex (8 9 15 14 28 29 35 34) ($blocksWake $blocksCirc 1) simpleGrading ($gradWake 1 1) // 8
    hex (10 11 17 16 30 31 37 36) ($blocksInlet $blocksOutR 1) simpleGrading (1 #eval{ 1.0 / $gradWall } 1) // 9
    hex (11 14 18 17 31 34 38 37) ($blocksCirc $blocksOutR 1) simpleGrading (1 #eval{ 1.0 / $gradWall } 1) // 10
    hex (14 15 19 18 34 35 39 38) ($blocksWake $blocksOutR 1) simpleGrading ($gradWake #eval{ 1.0 / $gradWall } 1) // 2
);

edges
(
    // cylinder
    arc 6 7 ($cylinderX #eval{ $cylinderY - $radiusIn } 0)
    arc 7 13 (#eval{ $cylinderX + $radiusIn } $cylinderY 0)
    arc 13 12 ($cylinderX #eval{ $cylinderY + $radiusIn } 0)
    arc 12 6 (#eval{ $cylinderX - $radiusIn } $cylinderY 0)
    arc 26 27 ($cylinderX #eval{ $cylinderY - $radiusIn } $lengthZ)
    arc 27 33 (#eval{ $cylinderX + $radiusIn } $cylinderY $lengthZ)
    arc 33 32 ($cylinderX #eval{ $cylinderY + $radiusIn } $lengthZ)
    arc 32 26 (#eval{ $cylinderX - $radiusIn } $cylinderY $lengthZ)
    // boundary layer region
    arc 5 8 ($cylinderX #eval{ $cylinderY - $radiusMid } 0)
    arc 8 14 (#eval{ $cylinderX + $radiusMid } $cylinderY 0)
    arc 14 11 ($cylinderX #eval{ $cylinderY + $radiusMid } 0)
    arc 11 5 (#eval{ $cylinderX - $radiusMid } $cylinderY 0)
    arc 25 28 ($cylinderX #eval{ $cylinderY - $radiusMid } $lengthZ)
    arc 28 34 (#eval{ $cylinderX + $radiusMid } $cylinderY $lengthZ)
    arc 34 31 ($cylinderX #eval{ $cylinderY + $radiusMid } $lengthZ)
    arc 31 25 (#eval{ $cylinderX - $radiusMid } $cylinderY $lengthZ)
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (16 17 37 36)
            (17 18 38 37)
            (18 19 39 38)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (1 0 20 21)
            (2 1 21 22)
            (3 2 22 23)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (4 0 20 24)
            (10 4 24 30)
            (16 10 30 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 9 29 23)
            (9 15 35 29)
            (15 19 39 35)
        );
    }
    back
    {
        type empty;
        faces
        (
            (1 0 4 5)
            (2 1 5 8)
            (3 2 8 9)
            (5 4 10 11)
            (6 5 11 12)
            (8 5 6 7)
            (8 7 13 14)
            (13 12 11 14)
            (9 8 14 15)
            (16 17 11 10)
            (14 11 17 18)
            (15 14 18 19)
        );
    }
    front
    {
        type empty;
        faces
        (
            (20 21 25 24)
            (21 22 28 25)
            (22 23 29 28)
            (24 25 31 30)
            (25 26 32 31)
            (25 28 27 26)
            (28 34 33 27)
            (34 31 32 33)
            (28 29 35 34)
            (30 31 37 36)
            (31 34 38 37)
            (34 35 39 38)
        );
    }
    cylinder
    {
        type patch;
        faces
        (
            (7 6 26 27)
            (13 7 27 33)
            (12 13 33 32)
            (6 12 32 26)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
